--▓      ▓▓▓  ▓   ▓  ▓▓▓  ▓   ▓ ▓▓▓▓▓   
--▓░    ▓ ░░▓  ▓ ▓ ░▓ ░░▓ ▓░  ▓░ ░▓░░░  
--▓░░   ▓▓▓▓▓░  ▓ ░ ▓░ ░▓░▓░░ ▓░░ ▓░░░░ 
--▓░░   ▓░░░▓░░ ▓░ ░▓░░ ▓░▓░░ ▓░░ ▓░░   
--▓▓▓▓▓ ▓░░░▓░░ ▓░░  ▓▓▓ ░░▓▓▓ ░░ ▓░░   
-- ░░░░░ ░░  ░░  ░░   ░░░ ░ ░░░ ░  ░░   
--  ░░░░░ ░   ░   ░    ░░░   ░░░    ░   


hl.config({
    general = {
        layout = "dwindle"
    },
    dwindle = {
        preserve_split = true, -- You probably want this
        force_split    = 2
    },
})


hl.config({
    master = {
        new_status = "master",
    },
})


hl.config({
    scrolling = {
        fullscreen_on_one_column = true,
    },
})
